{
  "title": "Software Engineerings",
  "work_available": "Available for work",
  "experience": "Experience",
  "about_me": "ABOUT",
  "home": "Home",
  "skills": "Skills",
  "projects": "Projects",
  "about": "About",
  "contact": "Contact",

  "home_section": {
    "profession1": "Software Engineering",
    "profession2": "Data Engineer",
    "profession3": "Full Stack Developer",
    "workAvailable": "Available for work"
  },

  "experience_section": {
    "title": "EXPERIENCE",
    "job_title1": "Credit Risk Intern",
    "range1": "2024 - Present",
    "company1": "Bank of the Nation of Peru",
    "role1_description1":"Automation of credit risk analysis and management processes using SQL and .NET.",
    "role1_description2":"Design, administration, and optimization of relational databases, ensuring efficiency in queries and response times.",
    "role1_description3":"Integration of systems and data sources (SQL Server, Access, and Excel) to unify information and optimize decision-making.",
    "role1_description4":"Development and implementation of Excel macros to automate the collection, processing, and consolidation of data downloaded from web portals, optimizing the preparation of reports and analysis templates.",
    "job_title2": "Freelance Developer",
    "range2": "2023 - Present",
    "company2": "Freelance",
    "role2_description1":" Custom desktop application development.",
    "role2_description2":" Creation of static and dynamic web pages.",
    "role2_description3":" Task automation and data processing."

  },

  "skills_section":{
    "title": "SKILLS",
    "subtitle1": "Languages",
    "subtitle2": "Frameworks and Libraries",
    "subtitle3": "Tools",
    "subtitle4": "Cloud and Providers"
  },

  "projects_section": {
    "title": "PROJECTS",
    "filter_title1": "All",
    "filter_title2": "Personal",
    "filter_title3": "Work",
    "more_info": "See more"
  },

  "rcc": {
    "title": "Datafile Processor",
    "description": "Automation project for reading and loading processes of the Consolidated Credit Report (RCC) at the Bank of the Nation of Peru.",
    "detailedDescription1": "Desktop application developed in .NET with SQL Server connection, designed to process large volumes of plain text (TXT) files dynamically and efficiently."
    ,"detailedDescription2": "Its objective is to automate the loading, transformation, and export of data to a structured database, optimizing processing times through block loading logic and the use of stored procedures."
    ,"titleDescription3": "Features",
    "detailedDescription3": [ "Block data loading with timer, optimizing performance.","Modular menu that allows processing different reports (RCC, PHFO, RCA, RCD).","Integrated functions: load data, export (.bak / tabulated) and clean tables.","The system automatically detects the user and server, ensuring adaptable and secure configuration." ],
    "titleDescription4": "Results",
    "detailedDescription4":[ "Reduction of massive data loading time.","Standardization of integration processes.","Intuitive and adaptable interface for different reports." ]

  },

  "la_once": {
    "title": "La Once",
    "description": "Project for an online business selling humitas and tamales.",
    "detailedDescription1": "LaOnce is a platform that allows users to make online purchases of tamales and humitas, offering an intuitive and secure user experience.",
    "detailedDescription2": "Also includes features such as order tracking, user management, and a secure payment system.",
    "titleDescription3": "Features",
    "detailedDescription3": ["Modern landing page with clear presentation of the brand and its products.","Interactive menu that facilitates navigation through different product categories.","Detailed product view with attractive descriptions and images.","Direct redirection to WhatsApp to facilitate communication and order placement."],
    "titleDescription4": "Results",
    "detailedDescription4":[ "Greater ease in exploring products and making purchase decisions.","Attractive and user-friendly interface that enhances the user experience.","Optimization of the purchasing process through integration with WhatsApp for direct communication."]

  },

  "flowers": {
    "title": "Flowers"
    ,"description": "Project for an interactive web page for a flower bouquet surprise.",
    "detailedDescription1": "Flowers is a web platform that allows users to send flower bouquets as a surprise to their loved ones, with an attractive and user-friendly experience.",
    "detailedDescription2": "Includes features such as entering the name of the surprised person, animation view.",
    "titleDescription3": "Features",
    "detailedDescription3": ["Personalized entry of the name of the person to whom the detail will be dedicated.","Animation of a bouquet of flowers accompanied by the entered name","Romantic or affectionate message that reinforces the surprise.","Simple, aesthetic, and easy-to-use interface, focused on the emotional experience.","Responsive design, compatible with mobile devices, tablets, and computers."],
    "titleDescription4": "Results",
    "detailedDescription4": ["A simple and creative way to send a personalized digital detail.","Attractive visual experience that generates surprise and emotion.","Attractive and easy-to-use interface that improves the user experience.","Accessibility from any device, facilitating the sending of the detail anytime and anywhere."]
  },  

  "reporte_sbs": {
    "title": "SBS Debtor Report",
    "description": "Automation project for generating financial reports required by the Superintendence of Banking, Insurance, and AFP (SBS) at the Bank of the Nation of Peru.",
    "detailedDescription1": "This project modernizes the original SBS debtor consultation system, offering a more visual, intuitive, and efficient interface, without losing the consultation and reporting logic that characterizes the traditional system.",
    "titleDescription3": "Features",
    "detailedDescription3": [   "Automatic and optimized processing of information before inserting it into monthly tables.",
      "Respect for the original functionalities of consultation and reporting of the SBS system.",
      "Interactive dashboard with dynamic graphs and clear visualization of debtor status.",
      "Modern and responsive interface, designed to enhance user experience and facilitate navigation."],
    "titleDescription4": "Results",
    "detailedDescription4": [ "Faster and more visual consultations.",
      "More organized and efficient internal processes.",
      "Significant improvement in user experience compared to the traditional system."]
  },

  "convertidor":{
    "title": "Converter",
    "description": "Desktop application that transforms plain text files of electronic receipts into Excel reports structured by client.",
    "detailedDescription1": "The system automates the reading and processing of files using regular expressions and tabulation techniques, facilitating the quick and orderly generation of information.",
    "titleDescription3": "Features",
    "detailedDescription3": [ "File loading via button, allowing easy selection of the TXT file to be processed.","Automatic processing of content using regular expressions to extract key data.","Simple and functional interface.","Generation of Excel reports ready for analysis or storage." ],
    "titleDescription4": "Results",
    "detailedDescription4": [ "Significant reduction in time spent on data organization and report generation.","Minimization of human errors in data transcription.","User-friendly interface that simplifies the conversion process for users of all levels." ]
  },



  "about_section": {
    "title": "ABOUT",
    "box_title1": "Experience",
    "box_subtitle11": "(years)",
    "box_subtitle12": "Intern",
    "box_title2": "Projects",
    "box_subtitle21": "Completed",
    "box_title3": "Support",
    "description": "Software engineer with experience in web development and data management. Passionate about technology and creating innovative solutions.",
    "download_cv": "Download CV"
  },

  "contact_section": {
    "title": "CONTACT",
    "subtitle": "Get in touch",
    "email": "Email",
    "writeMe": "Write me",
    "projectTitle": "Write me about your project",
    "nameLabel": "Name",
    "namePlaceholder": "Enter your Name",
    "emailLabel": "Email",
    "emailPlaceholder": "Enter your Email",
    "projectLabel": "Project",
    "projectPlaceholder": "Tell me about your project",
    "sendMessage": "Send Message",
    "sending": "Sending...",
    "successMessage": "Your message was sent successfully!",
    "errorMessage": "An error occurred while sending the message."
  },
  "footer": {
    "text": "All rights reserved."
  }


}


